Get the list of control points.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2016
 Syntax
  C#
public IList<XYZ> GetControlPoints()
  Visual Basic
Public Function GetControlPoints As IList(Of XYZ)
  Visual C++
public:
IList<XYZ^>^ GetControlPoints()
 See Also
  NurbsSurfaceData Class
  Autodesk.Revit.DB Namespace